wrkAndProfile/stage3/wrk_get_results
wrk -t4 -c100 -d15m -R5000 -s /home/valaubr/GitDirs/2020-highload-dht/src/test/wrkAndProfile/scripts/get.lua --latency http://127.0.0.1:8080 
Running 15m test @ http://127.0.0.1:8080
  4 threads and 100 connections
  Thread calibration: mean lat.: 21.810ms, rate sampling interval: 131ms
  Thread calibration: mean lat.: 26.356ms, rate sampling interval: 248ms
  Thread calibration: mean lat.: 20.692ms, rate sampling interval: 94ms
  Thread calibration: mean lat.: 21.342ms, rate sampling interval: 151ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.69ms    1.84ms  49.57ms   95.24%
    Req/Sec   194.59     38.80   320.00     56.16%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.36ms
 75.000%    1.69ms
 90.000%    2.25ms
 99.000%   10.73ms
 99.900%   22.35ms
 99.990%   33.50ms
 99.999%   44.10ms
100.000%   49.60ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.570     0.000000            1         1.00
       0.757     0.100000        72191         1.11
       0.917     0.200000       143419         1.25
       1.112     0.300000       214937         1.43
       1.222     0.400000       286706         1.67
       1.358     0.500000       358239         2.00
       1.464     0.550000       393840         2.22
       1.609     0.600000       430325         2.50
       1.638     0.650000       466343         2.86
       1.661     0.700000       501674         3.33
       1.687     0.750000       537616         4.00
       1.701     0.775000       556012         4.44
       1.716     0.800000       573288         5.00
       1.739     0.825000       590972         5.71
       1.787     0.850000       608797         6.67
       2.000     0.875000       626518         8.00
       2.159     0.887500       635471         8.89
       2.253     0.900000       644523        10.00
       2.339     0.912500       653351        11.43
       2.579     0.925000       662332        13.33
       2.813     0.937500       671274        16.00
       3.055     0.943750       675729        17.78
       3.387     0.950000       680195        20.00
       3.785     0.956250       684673        22.86
       4.275     0.962500       689140        26.67
       4.935     0.968750       693635        32.00
       5.367     0.971875       695855        35.56
       5.855     0.975000       698089        40.00
       6.499     0.978125       700329        45.71
       7.319     0.981250       702578        53.33
       8.399     0.984375       704811        64.00
       9.031     0.985938       705920        71.11
       9.671     0.987500       707043        80.00
      10.271     0.989062       708164        91.43
      11.055     0.990625       709283       106.67
      12.079     0.992188       710399       128.00
      12.631     0.992969       710958       142.22
      13.191     0.993750       711516       160.00
      13.879     0.994531       712078       182.86
      14.663     0.995313       712634       213.33
      15.687     0.996094       713192       256.00
      16.383     0.996484       713476       284.44
      17.007     0.996875       713752       320.00
      17.647     0.997266       714039       365.71
      18.255     0.997656       714315       426.67
      19.263     0.998047       714593       512.00
      19.839     0.998242       714732       568.89
      20.431     0.998437       714872       640.00
      21.103     0.998633       715014       731.43
      21.775     0.998828       715149       853.33
      22.463     0.999023       715290      1024.00
      22.895     0.999121       715362      1137.78
      23.423     0.999219       715432      1280.00
      24.175     0.999316       715500      1462.86
      24.959     0.999414       715569      1706.67
      25.695     0.999512       715639      2048.00
      26.223     0.999561       715674      2275.56
      26.831     0.999609       715709      2560.00
      27.327     0.999658       715744      2925.71
      28.367     0.999707       715779      3413.33
      29.263     0.999756       715814      4096.00
      29.727     0.999780       715832      4551.11
      30.191     0.999805       715849      5120.00
      30.687     0.999829       715866      5851.43
      31.519     0.999854       715884      6826.67
      32.527     0.999878       715901      8192.00
      33.023     0.999890       715910      9102.22
      33.567     0.999902       715919     10240.00
      34.335     0.999915       715928     11702.86
      35.231     0.999927       715936     13653.33
      36.223     0.999939       715945     16384.00
      36.383     0.999945       715949     18204.44
      37.087     0.999951       715954     20480.00
      37.439     0.999957       715958     23405.71
      37.983     0.999963       715962     27306.67
      39.263     0.999969       715967     32768.00
      40.671     0.999973       715970     36408.89
      41.279     0.999976       715972     40960.00
      41.791     0.999979       715973     46811.43
      42.271     0.999982       715975     54613.33
      43.167     0.999985       715978     65536.00
      43.295     0.999986       715979     72817.78
      44.031     0.999988       715980     81920.00
      44.095     0.999989       715981     93622.86
      44.831     0.999991       715982    109226.67
      44.895     0.999992       715983    131072.00
      45.311     0.999993       715984    145635.56
      45.311     0.999994       715984    163840.00
      45.855     0.999995       715985    187245.71
      45.855     0.999995       715985    218453.33
      46.207     0.999996       715986    262144.00
      46.207     0.999997       715986    291271.11
      46.207     0.999997       715986    327680.00
      46.399     0.999997       715987    374491.43
      46.399     0.999998       715987    436906.67
      46.399     0.999998       715987    524288.00
      46.399     0.999998       715987    582542.22
      46.399     0.999998       715987    655360.00
      49.599     0.999999       715988    748982.86
      49.599     1.000000       715988          inf
#[Mean    =        1.688, StdDeviation   =        1.841]
#[Max     =       49.568, Total count    =       715988]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  725198 requests in 15.00m, 47.03MB read
  Socket errors: connect 0, read 0, write 0, timeout 37658
Requests/sec:    805.77
Transfer/sec:     53.51KB